package com.example.holmesk.citylist;

import java.util.List;

/**
 * 作者：holmes k
 * 时间：2017.04.25 16:04
 */


public class CityBean {

    /**
     * message : success
     * data : [{"cities":["安阳","鞍山","安庆","安康","阿坝","阿拉善","阿克苏","阿勒泰","安顺"],"name":"A"},{"cities":["北京","蚌埠","保定","本溪","包头","亳州","滨州","白城","百色","白山","白银","宝鸡","保山","巴彦淖尔","巴中","北海","毕节","博尔塔拉","巴音郭楞"],"name":"B"},{"cities":["重庆","成都","长春","长沙","承德","常州","滁州","巢湖","沧州","常德","昌吉","长治","朝阳","潮州","郴州","楚雄","赤峰","池州","崇左"],"name":"C"},{"cities":["大连","东莞","德州","丹东","大理","大庆","大同","达州","德宏","德阳","定西","迪庆","东营"],"name":"D"},{"cities":["鄂州","鄂尔多斯","恩施"],"name":"E"},{"cities":["福州","阜阳","佛山","抚州","防城港","抚顺","阜新"],"name":"F"},{"cities":["广州","贵阳","桂林","赣州","广元","甘孜","广安","贵港","固原"],"name":"G"},{"cities":["杭州","合肥","哈尔滨","海口","衡阳","邯郸","呼和浩特","黄冈","黄石","湖州","衡水","呼伦贝尔","黄山","海北","海西","哈密","汉中","鹤壁","河池","鹤岗","黑河","和田","河源","菏泽","贺州","红河","淮安","淮北","怀化","淮南","惠州","葫芦岛"],"name":"H"},{"cities":["吉林","济南","九江","揭阳","酒泉","嘉兴","荆州","锦州","佳木斯","吉安","江门","焦作","嘉峪关","金昌","晋城","景德镇","荆门","金华","济宁","晋中","鸡西","济源"],"name":"J"},{"cities":["昆明","开封","喀什","克拉玛依","克孜勒苏"],"name":"K"},{"cities":["兰州","廊坊","六安","乐山","来宾","柳州","聊城","莱芜","拉萨","洛阳","凉山","连云港","辽阳","辽源","丽江","临沧","临汾","临夏","临沂","林芝","丽水","六盘水","陇南","龙岩","娄底","漯河","泸州","吕梁"],"name":"L"},{"cities":["绵阳","马鞍山","茂名","眉山","梅州","牡丹江"],"name":"M"},{"cities":["南京","南昌","南宁","宁波","南通","南充","南平","南阳","内江","宁德"],"name":"N"},{"cities":["莆田","濮阳","盘锦","攀枝花","平顶山","平凉","萍乡","普洱"],"name":"P"},{"cities":["青岛","秦皇岛","泉州","衢州","曲靖","黔东南","黔南","黔西南","庆阳","清远","钦州","齐齐哈尔","七台河"],"name":"Q"},{"cities":["日照","日喀则"],"name":"R"},{"cities":["上海","深圳","沈阳","石家庄","三门峡","三明","三亚","商洛","商丘","苏州","汕头","汕尾","十堰","遂宁","上饶","绍兴","邵阳","双鸭山","朔州","四平","松原","绥化","随州","宿迁","宿州","石嘴山","韶关"],"name":"S"},{"cities":["天津","太原","唐山","台州","塔城","泰安","铁岭","泰州","天水","铜川","通化","通辽","铜陵","铜仁","吐鲁番"],"name":"T"},{"cities":["武汉","温州","无锡","乌鲁木齐","芜湖","潍坊","威海","渭南","文山","乌海","乌兰察布","武威","吴忠","梧州"],"name":"W"},{"cities":["西安","厦门","湘潭","徐州","许昌","信阳","西宁","咸阳","宣城","新乡","湘西","襄阳","咸宁","孝感","锡林郭勒","兴安","邢台","新余","忻州","西双版纳","香港"],"name":"X"},{"cities":["扬州","银川","宜昌","岳阳","榆林","烟台","雅安","延安","延边","盐城","阳江","阳泉","宜宾","伊春","宜春","伊犁","营口","鹰潭","益阳","永州","玉林","运城","云浮","玉溪"],"name":"Y"},{"cities":["珠海","肇庆","张家口","中山","淄博","驻马店","枣庄","张家界","张掖","漳州","湛江","昭通","郑州","镇江","中卫","周口","舟山","株洲","自贡","资阳","遵义"],"name":"Z"}]
     */

    private String message;
    private List<DataBean> data;

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * cities : ["安阳","鞍山","安庆","安康","阿坝","阿拉善","阿克苏","阿勒泰","安顺"]
         * name : A
         */

        private String name;
        private List<String> cities;

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public List<String> getCities() {
            return cities;
        }

        public void setCities(List<String> cities) {
            this.cities = cities;
        }
    }
}
